-- ============================================================
-- Вариант 15203
-- ============================================================


-- ============================================================
-- 1. Сделать запрос для получения атрибутов из указанных таблиц, применив фильтры по указанным условиям:
--   Н_ТИПЫ_ВЕДОМОСТЕЙ, Н_ВЕДОМОСТИ.
--   Вывести атрибуты: Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД, Н_ВЕДОМОСТИ.ДАТА.
--   Фильтры (AND):
--   a) Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД = 2.
--   b) Н_ВЕДОМОСТИ.ИД > 1250981.
--   Вид соединения: INNER JOIN.

SELECT Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД, Н_ВЕДОМОСТИ.ДАТА
FROM Н_ТИПЫ_ВЕДОМОСТЕЙ INNER JOIN Н_ВЕДОМОСТИ
ON Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД = Н_ВЕДОМОСТИ.ТВ_ИД
WHERE Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД = 2 AND Н_ВЕДОМОСТИ.ИД > 1250981;
-- ============================================================


-- ============================================================
-- 2. Сделать запрос для получения атрибутов из указанных таблиц, применив фильтры по указанным условиям:
--   Таблицы: Н_ЛЮДИ, Н_ВЕДОМОСТИ, Н_СЕССИЯ.
--   Вывести атрибуты: Н_ЛЮДИ.ОТЧЕСТВО, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_СЕССИЯ.ЧЛВК_ИД.
--   Фильтры (AND):
--   a) Н_ЛЮДИ.ИД = 100865.
--   b) Н_ВЕДОМОСТИ.ИД > 1250981.
--   c) Н_СЕССИЯ.УЧГОД > 2008/2009.
--   Вид соединения: INNER JOIN.
--
-- Н_СЕССИЯ.ЧЛВК_ИД - препод, смотреть через группу
--
-- Сессия - ведомости через сэс_ид
-- ведомости - ученик через члвк_ид

SELECT DISTINCT Н_ЛЮДИ.ОТЧЕСТВО, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_СЕССИЯ.ЧЛВК_ИД
FROM Н_ЛЮДИ
INNER JOIN Н_ВЕДОМОСТИ
ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
INNER JOIN Н_СЕССИЯ
ON Н_ВЕДОМОСТИ.СЭС_ИД = Н_СЕССИЯ.СЭС_ИД
WHERE Н_СЕССИЯ.УЧГОД > '2008/2009'
AND Н_ВЕДОМОСТИ.ИД > 1250981;

Н_ЛЮДИ.ИД = 105590-- с этим условием нет строк
-- ============================================================


-- ============================================================
-- 3. Вывести число студентов ФКТИУ, которые старше 25 лет.
--     Ответ должен содержать только одно число.

SELECT COUNT(*)
FROM Н_ОТДЕЛЫ JOIN Н_ПЛАНЫ ON Н_ОТДЕЛЫ.ОТД_ИД = Н_ПЛАНЫ.ОТД_ИД
JOIN Н_УЧЕНИКИ ON Н_ПЛАНЫ.ИД = Н_УЧЕНИКИ.ПЛАН_ИД
JOIN Н_ОБУЧЕНИЯ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
JOIN Н_ЛЮДИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ < CURRENT_DATE - INTERVAL '25 years';
-- AND Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ';

-- таких записей нет

-- ============================================================


-- ============================================================
-- 4. В таблице Н_ГРУППЫ_ПЛАНОВ найти номера планов,
--   по которым обучается (обучалось) менее 2 групп на очной форме обучения.
--   Для реализации использовать соединение таблиц.

SELECT Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД
FROM Н_ФОРМЫ_ОБУЧЕНИЯ
JOIN Н_ПЛАНЫ ON Н_ФОРМЫ_ОБУЧЕНИЯ.ИД = Н_ПЛАНЫ.ФО_ИД
JOIN Н_ГРУППЫ_ПЛАНОВ ON Н_ПЛАНЫ.ПЛАН_ИД = Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД
WHERE Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Очная'
GROUP BY Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД
HAVING COUNT(Н_ГРУППЫ_ПЛАНОВ.ГРУППА) < 2;
-- ============================================================


-- ============================================================
-- 5. Выведите таблицу со средними оценками студентов группы 4100 (Номер, ФИО, Ср_оценка),
--  у которых средняя оценка не больше максимальной оценк(е|и) в группе 3100.

SELECT
    Н_УЧЕНИКИ.ЧЛВК_ИД AS Номер,
	Н_ЛЮДИ.ФАМИЛИЯ ||' '|| Н_ЛЮДИ.ИМЯ || ' ' || Н_ЛЮДИ.ОТЧЕСТВО AS ФИО,
	ROUND(AVG(Н_ОЦЕНКИ.СОРТ), 2) AS Ср_оценка
FROM Н_УЧЕНИКИ
JOIN Н_ЛЮДИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN Н_ОБУЧЕНИЯ  ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД  = Н_ЛЮДИ.ИД
JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД  = Н_ЛЮДИ.ИД
JOIN Н_ОЦЕНКИ ON Н_ОЦЕНКИ.КОД = Н_ВЕДОМОСТИ.ОЦЕНКА
WHERE Н_УЧЕНИКИ.ГРУППА = '4100'
GROUP BY Н_УЧЕНИКИ.ЧЛВК_ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО
HAVING ROUND(AVG(Н_ОЦЕНКИ.СОРТ), 2) <= (
    SELECT MAX(round) from ( -- 3.49 максимум
		SELECT ROUND(AVG(Н_ОЦЕНКИ.СОРТ), 2), Н_УЧЕНИКИ.ЧЛВК_ИД
		FROM Н_УЧЕНИКИ
		JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
		JOIN Н_ОЦЕНКИ ON Н_ОЦЕНКИ.КОД = Н_ВЕДОМОСТИ.ОЦЕНКА
		WHERE Н_УЧЕНИКИ.ГРУППА = '3100' AND Н_ОЦЕНКИ.СОРТ < 5
		GROUP BY Н_УЧЕНИКИ.ЧЛВК_ИД
	)
);
-- ============================================================


-- ============================================================
-- 6. Получить список студентов, отчисленных ровно первого сентября 2012 года с заочной формы обучения. В результат включить:
--   номер группы;
--   номер, фамилию, имя и отчество студента;
--   номер пункта приказа;
--   Для реализации использовать подзапрос с EXISTS.

SELECT Н_УЧЕНИКИ.ГРУППА, Н_УЧЕНИКИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, Н_УЧЕНИКИ.П_ПРКОК_ИД, Н_УЧЕНИКИ.КОНЕЦ_ПО_ПРИКАЗУ
FROM Н_УЧЕНИКИ
JOIN Н_ЛЮДИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
WHERE EXISTS (
     SELECT 1 FROM Н_УЧЕНИКИ
     JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
     JOIN Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
     WHERE Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Очная'
)
AND Н_УЧЕНИКИ.КОНЕЦ_ПО_ПРИКАЗУ::DATE = '2012-08-31'; -- преобразование типов
-- ============================================================


-- ============================================================
-- 7. Вывести список студентов, имеющих одинаковые имена, но не совпадающие даты рождения.
-- Уник пары (имя + дата)

SELECT DISTINCT Л1.ИМЯ, Л1.ДАТА_РОЖДЕНИЯ
FROM "Н_ЛЮДИ" Л1
WHERE EXISTS (
    SELECT 1 FROM "Н_УЧЕНИКИ" У
    WHERE У.ЧЛВК_ИД = Л1.ИД
)
AND Л1.ИМЯ IN (
    SELECT ИМЯ
    FROM "Н_ЛЮДИ"
    GROUP BY ИМЯ
    HAVING COUNT(DISTINCT ДАТА_РОЖДЕНИЯ) > 1
)
ORDER BY Л1.ИМЯ;


-- ============================================================

-- склейка через where или join. разнциа
